# ElementId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementNode..::..ElementId Property
ElementNode Class See Also
---
The Id of the element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public ElementId ElementId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ElementId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ ElementId {
	ElementId^ get ();
}
```

# See Also
ElementNode Class
Autodesk.Revit.DB Namespace